app/views/comments/_comment.html.erb

<% @article.comments.each do |c| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 8