app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "safd "], ["content", "sdfsdf"], ["created_at", 2016-09-21 07:05:39 UTC], ["updated_at", 2016-09-21 07:05:39 UTC]]
---
	def create
		@article = Article.new(article_params)

		if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "sdf"], ["content", "dfgweeee"], ["updated_at", 2016-09-21 09:22:13 UTC], ["id", 7]]
---
	def update
		@article = Article.find(params[:id])

		if @article.update(article_params)

SELECT `articles`.* FROM `articles`
---
	def index
		@articles = Article.all