app/controllers/comments_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 8 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`) VALUES ('dsgfsdfsdf', 'sdfsdf', 8, '2016-12-01 12:57:17', '2016-12-01 12:57:17')
---
	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(comment_params)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 8 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`article_id` = 8 AND `comments`.`id` = 3 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 3
---
	def destroy
		@article = Article.find(params[:article_id])
		@comment = @article.comments.find(params[:id])
		@comment.destroy